{
  "preface": "A dread shadow stalks the land! Arch-Wizard Valderak, freed from his timeless prison, has come to wreak vengeance on the people of The Four Kingdoms. From his tower deep in the Forest of Poison, he plots a terrible revenge. Four heroes, the greatest from each of the Kingdoms, have been sent to thwart the schemes of the Arch-Wizard and restore peace to the land.",
  "level-one": "You and your party make your through the Forest of Poison, through foul waters and rotting trees. Before you, rising like a thorn from the putrid mire, stands the dark tower of Valderak, its arched windows filled with the green fire of his baleful magics. You step inside the echoing tower and encounter the first of line of Valderak's defenses - the people of the forest, now corrupted by Valderak.",
  "level-two": "Defeating the forest folk, you are able to free them from the influence of Valderak. Before fleeing the terrible tower they give you the key to the upper floors. Ascending the winding stairs your ears pick up a harsh, clanking sound. There is smoke on the air. Opening a door to an upper chamber, you encounter Valderak's lieutenant, an Engine of Chaos.",
  "level-three": "The Engine of Chaos is destroyed and from its wreckage you pluck the source of its power, a Gem of Annihilation. Using it you dispel the wards and magics protecting the inner sanctum of Valderak, allowing you to enter the lair of the Arch-Wizard. You find him, hunched and wizened over his scrying table. With a screech of disgust he conjures his Poison Blade, and with one final curse on the Four Kingdoms, launches himself at you. Battle is joined.",
  "victory": "With a blood-curdling scream, the magics holding the Arch-Wizard together are sundered for good- in a great rush of cold green fire, the body falls, nothing more than a few rags and bones. The dark tower begins to shudder beneath your feet - without Valderak to maintain it, it is beginning to sink into the swamp. You fly for the exit, escaping just in time to see the sharp roof sink beneath the waters. The stain on the landscape, the blight on the Four Kingdoms, Valderak the Arch-Wizard is no more.",
  "failure": "All your valour, all your bravery, was for naught. You have been vanquished. It is a dark day for the Four Kingdoms as its greatest champions lie defeated, but there will be many dark days ahead, for now nothing stands in the way of Valderak's final victory. All is lost."
}